{
  "updates": [
    {
      "date": "2025-11-18T11:42:54.270Z",
      "content": "We are currently experiencing degraded performance caused by an ongoing Cloudflare incident. Due to issues within Cloudflare’s infrastructure, a percentage of API requests are not being properly routed to our servers. This may result in intermittent errors or failed requests for some customers.\n\nOur systems remain fully operational, and we are actively monitoring the situation while Cloudflare works to resolve the upstream problem. We will provide updates as soon as more information becomes available.\n\nMore info on: https://www.cloudflarestatus.com/incidents/8gmgl950y3h7",
      "status": "investigating"
    },
    {
      "date": "2025-11-18T13:58:21.034Z",
      "status": "investigating",
      "content": "The Cloudflare outage has escalated, and is now causing service disruptions across DatoCMS. We are experiencing outages with:\n* DatoCMS APIs (CDA and CMA)\n* datocms-assets.com\n* The dashboard and admin area\n* The community forum\n* The status page uptime indicators are stuck at \"loading\"\n\nOur Slack remains available: https://join.slack.com/t/datocms/shared_invite/zt-3j142172p-nou_g2g5vUAPL6cjOOz5zQ\n\nWe will update as soon as we can."
    },
    {
      "date": "2025-11-18T14:37:11.078Z",
      "status": "monitoring",
      "content": "Services are gradually coming back up, but we don't know yet if this is a stable fix or if there will be further downtime.\n\nAPIs, datocms-assets.com, dashboard, project admin area, and forum are back up for the time being.\n\nEDIT: As of 14:42 UTC, Cloudflare believes services are restored: https://www.cloudflarestatus.com/incidents/8gmgl950y3h7. We will keep monitoring to be sure.\n\nPlease keep an eye here for further updates, join our Slack (https://join.slack.com/t/datocms/shared_invite/zt-3j142172p-nou_g2g5vUAPL6cjOOz5zQ), or reach out to us at support@datocms.com if you need help."
    },
    {
      "date": "2025-11-18T15:08:20.853Z",
      "content": "As of 14:42 UTC (15:42 CEST/06:42 PST), Cloudflare believes the issue to be resolved. All DatoCMS services should be back up.\n\nWe will continue to monitor, just in case.\n\nIf you need help, please email support@datocms.com.",
      "status": "monitoring"
    },
    {
      "date": "2025-11-18T20:52:34.924Z",
      "status": "resolved",
      "content": "The outage should be resolved."
    }
  ],
  "name": "Major DatoCMS Outages Caused by Upstream Cloudflare Incident",
  "impact": "critical"
}